Revit 2027 API
ColorFillScheme.IsValidSchemeName Method
 Checks whether the name is valid for new generated scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSchemeName(
	string name
)
Public Function IsValidSchemeName (
	name As String
) As Boolean
public:
bool IsValidSchemeName(
	String^ name
)
member IsValidSchemeName :
        name : string -> bool
Parameters
name String
Return Value
Boolean
 Returns true if the name is valid for new generated scheme, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The name should not be empty, or all spaces, or include prohibited characters or duplicated with existing schemes.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace